const f1 = document.querySelector('#f1');
const f2 = document.querySelector('#f2');
const f3 = document.querySelector('#f3');
const f4 = document.querySelector('#f4');
const f5 = document.querySelector('#f5');
const f6 = document.querySelector('#f6');
const f7 = document.querySelector('#f7');
const f8 = document.querySelector('#f8');

const f_intro = document.querySelector('#f_intro') 

f1.addEventListener('mouseenter',()=>{
    f_intro.innerHTML = 
    `
    <p>
    吃春盘，春饼，春卷，春盒，吃生菜，吃萝卜，谓之“咬春”。据《四时宝鉴》说：“立春日春饼、生菜， 号春盘。”春饼是以麦面烙制或蒸制的薄饼，以豆芽、韭黄、粉丝等炒成的合菜作馅儿包着食用。元朝时契丹人耶律楚材曾就此俗作诗一首曰：“昨朝春日偶然忘，试作春盘我一尝。木案初开银线乱，砂瓶煮熟藕丝长。匀和碗豆搡葱白，细剪萎蒿点韭黄。也与何曾同是饱，区区何必待膏粱。”现在除了传统的豆芽炒韭菜之外，还有肉丝、蛋丝、香菇等佐料；也有一种是甜的，用干果、芝麻、花生等佐料碾碎作馅，香甜可口。
    </p><br>
    `
})
f2.addEventListener('mouseenter',()=>{
    f_intro.innerHTML = 
    `
    <p>
    </p><br>
    元代娄元礼《田家五行》记载了当时华南稻作地区“占稻色”的习俗：“雨水节，烧干镬，以糯稻爆之，谓之孛罗花，占稻色。”所谓“占稻色”就是通过爆炒糯谷米花，来占卜是年稻获的丰歉，即预测稻谷的成色。成色足则意味着高产，成色不足则意味着产量低。而“成色”的好坏，就看爆出的糯米花多少。爆出来白花花的糯米越多，则是年稻获的收成越好;而爆出来的米花越少，则意味着是年收成不好，米价将贵。
    <p>
    宋代以前，中国农业甚至整个经济重心一直在中国北部的黄河流域。宋代开始，随着中国经济重心的南移，南部中国的稻作文化逐渐成为中国农业文明的主体。由宋至元再历经明清，客家近千年地传承着宋代特色的稻作文化习俗。
    </p><br>

    `
})
f3.addEventListener('mouseenter',()=>{
    f_intro.innerHTML = 
    `
    <p>
    对于北京人来说，夏至是吃“夏至面”的日子。《帝京岁时纪胜》中记载：“夏至大祀方泽，乃国之大典。京师于是日家家俱食冷淘面，即俗说过水面是也。”过水面就是用凉水泡过的熟面条，浇上各种卤和菜码，吃起来凉而爽口。对于炎炎夏日里，被酷暑折磨得失了几分胃口的人们来说，一碗清新爽口的过水面，的确好吃而适时。
    </p><br>
    `
})
f4.addEventListener('mouseenter',()=>{
    f_intro.innerHTML = 
    `
    <p>
    </p><br>
    初夏是青梅的时节。“梅叶未藏禽，梅子青可摘。”每年的五、六月份，青梅成熟，山上便开始弥漫着青梅的香气。新鲜梅子大多味道酸涩，难以直接入口，需加工后方可食用，这种加工过程便是煮梅。三国时就有“青梅煮酒论英雄”的典故，酒中里夹杂着青梅独有青涩味道，淡而独特的果香混合着酒香，别有一番滋味。
    `
})
f5.addEventListener('mouseenter',()=>{
    f_intro.innerHTML = 
    `
    <p>
    浙江苍南、平阳等地民间，有过“白露节”的风俗。人们会在白露那天使用九样带有“白”字的食物或者药材，再搭配着乌骨白毛鸡或白正番鸭炖成十样白。《月令七十二候集解》中谈到：“水土湿气凝而为露，秋属金，金色白，白者露之色，百气始寒也。”白露时节，不仅多露水，秋燥也重，吃完炖鸡或者炖鸭之后，就可以去除体内的湿气，所以就有了“白露十样白，老头变小孩”的说法。
    </p><br>
    `
})
f6.addEventListener('mouseenter',()=>{
    f_intro.innerHTML = 
    `
    <p>
    在我国岭南的一些地方，秋分时节有着“吃秋菜”的习俗。所谓的秋菜，实际上是一种岭南地区生长的野苋菜，细长嫩绿，当地人称之为“秋碧蒿”。在这天，人们会上山去采摘秋菜，回家后和鱼片一起熬成汤。俗话说，“秋汤灌脏，洗涤肝肠。阖家老少，平安健康。”简单的秋菜不仅包含着人们对美好生活的憧憬，更体现了一种寓食于节的民俗传承。
    </p><br>
    `
})
f7.addEventListener('mouseenter',()=>{
    f_intro.innerHTML = 
    `
    <”这种习俗，是为纪念“医圣”张仲景冬至舍药。东汉建安年间张仲景曾任长沙太守，后毅然辞官回乡，为乡邻治病。其返乡之时，正是冬季。他看到白河两岸乡亲面黄肌瘦，饥寒交迫，便在冬至那天舍“祛寒娇耳汤””医治冻疮。后来人们学着“娇耳”的样子，包成食物，也叫“饺子”。时至今日，南阳仍流传着“冬至不端饺子碗，冻掉耳朵没人管”的民谣。>每年立冬，饺子是必不可少的节日饭。谚云：“十月一，冬至到，家家户户吃水饺。”这种习俗，是为纪念“医圣”张仲景冬至舍药。东汉建安年间张仲景曾任长沙太守，后毅然辞官回乡，为乡邻治病。其返乡之时，正是冬季。他看到白河两岸乡亲面黄肌瘦，饥寒交迫，便在冬至那天舍“祛寒娇耳汤””医治冻疮。后来人们学着“娇耳”的样子，包成食物，也叫“饺子”。时至今日，南阳仍流传着“冬至不端饺子碗，冻掉耳朵没人管”的民谣。</p><br>
    `
})
f8.addEventListener('mouseenter',()=>{
    f_intro.innerHTML = 
    `
    <p>
    每到冬至，吴川市的大街小巷就摆满了各种刚从地里挖出来的姜，平时难得一见的各种野姜也出现在冬至的市场上。
    </p><br>
    <p>
    这个时节，又适逢腊肉、腊肠、腊鸭等各种美味腊味上市。在冬至这天，人们都会买来各种各样的生姜片和腊肉、腊肠、腊鸭，煮美味可口的腊味姜饭。7种不同颜色的姜，浸泡了姜汁而黄澄澄的米饭，佐以香气十足的腊味，点缀上葱花和芫荽碎，整一锅热气腾腾出炉。吃上一口热腾腾的腊味姜饭，在御寒滋补的同时，吴川人民也享受着团圆的欢乐。
    </p><br>
    `
})


const f_item = document.querySelectorAll('.f_five > .view > .item')

for(let i = 0; i< f_item.length; i++){
    f_item[i].addEventListener('mouseenter',()=>{
        f_item[i].style.flexBasis = '20%';
    })
    f_item[i].addEventListener('mouseleave',()=>{
        f_item[i].style.flexBasis = '0%';
    })
}